<a href="https://colab.research.google.com/github/191919201921/Zadania_Domowe_ADS/blob/main/Kopia_notatnika_M3MORE_PANDAS_PYTHON.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Praktyczne zadania - Podstawy Pandas w Python**

# Zadanie 1

1. Zaimportuj pandas jako pd<br>
2. Zaimportuj numpy jako np

3. Stwórz obiekt pandas Series z listy zakupów poniżej. Przypisz go do zmiennej **lista_zakupow** i wyświetl:
  *   mleko
  *   jajka
  *   pieprz
  *   ser
  *   woda
  *   piwo
  *   pomidory

4. Wyświetl tylko wartości (values) tego obiektu Series.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
lista_zakupow = pd.Series(['mleko','jajka','pieprz','ser','woda','piwo','pomidory'])
lista_zakupow.values

array(['mleko', 'jajka', 'pieprz', 'ser', 'woda', 'piwo', 'pomidory'],
      dtype=object)

In [ ]:
for x in lista_zakupow.values:
  print(x)

mleko
jajka
pieprz
ser
woda
piwo
pomidory

## Podpowiedzi

In [ ]:
# Obiekt typu Series w pandas generuje się za pomocą pd.Series
# Series to jednowymiarowy, indeksowany szyk (array), będący w stanie przechowywać dane dowolnego typu.
# Oś labeli jest nazywana jako index.
# Oś z właściwą zawartością Series nazywana jest jako wartości (values).

## Podpowiedzi + rozwiązanie

In [ ]:
# Obiekt typu Series w pandas generuje się za pomocą pd.Series
# Series to jednowymiarowy, indeksowany szyk (array), będący w stanie przechowywać dane dowolnego typu.
# Oś labeli jest nazywana jako index.
# Oś z właściwą zawartością Series nazywana jest jako wartości (values).

import pandas as pd
import numpy as np
lista_zakupow = pd.Series(["mleko", "jajka", "pieprz", "ser", "woda", "piwo", "pomidory"])

print(lista_zakupow)
print(lista_zakupow.values)

0       mleko
1       jajka
2      pieprz
3         ser
4        woda
5        piwo
6    pomidory
dtype: object
['mleko' 'jajka' 'pieprz' 'ser' 'woda' 'piwo' 'pomidory']

#Zadanie 2

1. Stwórz obiekt pandas Date Series rozpoczynający się od 1 stycznia 2019r. i kończący na 1 stycznia 2020r. z krokiem miesięcznym. 

2. Zapisz jako **miesiace_series**. Wyświetl wynik.

3. Stwórz kolejny obiekt pandas Date Series rozpoczynający się 1 stycznia 2019r. i pokrywający 12 okresów co miesiąc. 

4. Zapisz jako **miesiace_series_okres**. Wyświetl wynik.

5. Czy te dwa obiekty są identyczne?

In [ ]:
miesiace_series = pd.date_range(start='1/1/2019',end='1/1/2020',freq='M')
miesiace_series

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='M')

In [ ]:
miesiace_series_okres = pd.date_range(start='1/1/2019',freq='M',periods=12)
miesiace_series_okres

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='M')

##Podpowiedzi

In [ ]:
# Do tworzenia obiektu Date Series (dtype = 'datetime64[ns]') należy wykorzystać funkcję pd.date_range()
# W jej dokumentacji znajdziesz opis parametru start, end, freq, periods - będą one niezbędne do zrealizowania zadania.
# W pracy ze zbiorami danych znaczącą część czasu zabiera czyszczenie i transformacja danych związanych z czasem. Nie uciekniesz od tego.

##Podpowiedzi + rozwiązanie

In [ ]:
# Do tworzenia obiektu Date Series (dtype = 'datetime64[ns]') należy wykorzystać funkcję pd.date_range()
# W jej dokumentacji znajdziesz opis parametru start, end, freq, periods - będą one niezbędne do zrealizowania zadania.
# W pracy ze zbiorami danych znaczącą część czasu zabiera czyszczenie i transformacja danych związanych z czasem. Nie uciekniesz od tego.

miesiace_series = pd.date_range(start = '20190101', end = '20200101', freq = 'M')
print(miesiace_series)

miesiace_series_okres = pd.date_range(start = '20190101', freq = 'M', periods = 12)
print(miesiace_series_okres)
print(miesiace_series == miesiace_series_okres)

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='M')
DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='M')
[ True  True  True  True  True  True  True  True  True  True  True  True]

#Zadanie 3

1. Stwórz obiekt pandas Date Series rozpoczynający się od 1 stycznia 2019 a kończący na 3 stycznia 2019 z krokiem co godzinę.
2. Zapisz jako **godziny_series**
3. Wyświetl wynik.

In [ ]:
godziny_series = pd.date_range('1/1/2019','3/1/2019',freq="h")
godziny_series

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 01:00:00',
               '2019-01-01 02:00:00', '2019-01-01 03:00:00',
               '2019-01-01 04:00:00', '2019-01-01 05:00:00',
               '2019-01-01 06:00:00', '2019-01-01 07:00:00',
               '2019-01-01 08:00:00', '2019-01-01 09:00:00',
               ...
               '2019-02-28 15:00:00', '2019-02-28 16:00:00',
               '2019-02-28 17:00:00', '2019-02-28 18:00:00',
               '2019-02-28 19:00:00', '2019-02-28 20:00:00',
               '2019-02-28 21:00:00', '2019-02-28 22:00:00',
               '2019-02-28 23:00:00', '2019-03-01 00:00:00'],
              dtype='datetime64[ns]', length=1417, freq='H')

##Podpowiedzi

In [ ]:
# Aby otrzymać krok godzinowy, ustaw parametr freq='H' w funkcji pd.date_range()

##Podpowiedzi + rozwiązanie

In [ ]:
# Aby otrzymać krok godzinowy, ustaw parametr freq='H' w funkcji pd.date_range()

godziny_series = pd.date_range(start='20190101', end='20190103', freq='H')
print(godziny_series)

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 01:00:00',
               '2019-01-01 02:00:00', '2019-01-01 03:00:00',
               '2019-01-01 04:00:00', '2019-01-01 05:00:00',
               '2019-01-01 06:00:00', '2019-01-01 07:00:00',
               '2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00',
               '2019-01-01 18:00:00', '2019-01-01 19:00:00',
               '2019-01-01 20:00:00', '2019-01-01 21:00:00',
               '2019-01-01 22:00:00', '2019-01-01 23:00:00',
               '2019-01-02 00:00:00', '2019-01-02 01:00:00',
               '2019-01-02 02:00:00', '2019-01-02 03:00:00',
               '2019-01-02 04:00:00', '2019-01-02 05:00:00',
               '2019-01-02 06:00:00', '2019-01-02 07:00:00',
               '2019-01-02 08:00:00', '2019-01-02 09:00:00',
               '2019-01-02 10:00:00', '2019-01-02 11:00:00',
               '2019-01-02 12:00:00', '2019-01-02 13:00:00',
               '2019-01-02 14:00:00', '2019-01-02 15:00:00',
               '2019-01-02 16:00:00', '2019-01-02 17:00:00',
               '2019-01-02 18:00:00', '2019-01-02 19:00:00',
               '2019-01-02 20:00:00', '2019-01-02 21:00:00',
               '2019-01-02 22:00:00', '2019-01-02 23:00:00',
               '2019-01-03 00:00:00'],
              dtype='datetime64[ns]', freq='H')

#Zadanie 4

1. Stwórz obiekt numpy array z wartościami bezwzględnymi na podstawie [6, -23, 53, -2, 6]. Nazwij go **abs_wartosci**.

2. Na jego podstawie stwórz obiekt pandas Series i zapisz jako **abs_series**.

3. Wyświetl wynik i typ obiektu.
4. Ponad to wyświetl:
* kształt tego series;
* wartość średnią;
* medianę;
* wypisz unikatowe wartości w tym series;
* policz ilość unikalnych wartości w tym series.

In [ ]:
ar = np.abs([6, -23, 53, -2, 6])
abs_wartosci = abs(ar)
abs_wartosci

array([ 6, 23, 53,  2,  6])

In [ ]:
abs_series = pd.Series(abs_wartosci)
abs_series

0     6
1    23
2    53
3     2
4     6
dtype: int64

In [ ]:
type(abs_series)

pandas.core.series.Series

In [ ]:
abs_series.dtypes

dtype('int64')

In [ ]:
print(abs_series.shape)
print(abs_series.median())
print(abs_series.mean())
print(abs_series.unique())
print(abs_series.value_counts())

(5,)
6.0
18.0
[ 6 23 53  2]
6     2
23    1
53    1
2     1
dtype: int64

##Podpowiedzi

In [ ]:
# Potraktuj to zadanie jako bardzo wstępny wstęp do analizy danych.
# Do wyświetlenia pożądanych wartości wykorzystaj funkcje: 
# .shape, .dtype, .mean(), .median(), .unique(), value_counts()

##Podpowiedzi + rozwiązanie

In [ ]:
# Potraktuj to zadanie jako bardzo wstępny wstęp do analizy danych.
# Do wyświetlenia pożądanych wartości wykorzystaj funkcje: 
# .shape, .dtype, .mean(), .median(), .unique(), value_counts()

abs_wartosci = abs(np.array( [6, -23, 54, -2, 6] ))
abs_series = pd.Series(abs_wartosci)

print(abs_series)
print("Kształt: ", abs_series.shape)
print("Typ: ", abs_series.dtype)
print("Średnia: ", abs_series.mean())
print("Mediana: ", abs_series.median())
print("Wartości unikalne: ", abs_series.unique())
print("Wartości unikalne policzone: ", abs_series.value_counts())

0     6
1    23
2    54
3     2
4     6
dtype: int64
Kształt:  (5,)
Typ:  int64
Średnia:  18.2
Mediana:  6.0
Wartości unikalne:  [ 6 23 54  2]
Wartości unikalne policzone:  6     2
23    1
54    1
2     1
dtype: int64

#Zadanie 5

Biorąc obiekt **abs_series** z zadania 4, wykonaj następujące operacje:

- wskazanie pozycji najmniejszej wartości w series
- wskazanie pozycji największej wartości w series
- posortowanie wartości w kolejności malejącej
- wyliczenie sumy wartości
- wyliczenie sumy kumulatywnej (cumsum() )

In [ ]:
abs_series.min()

2

In [ ]:
abs_series.max()

54

In [ ]:
abs_series.sort_values(ascending=False)

2    54
1    23
4     6
0     6
3     2
dtype: int64

In [ ]:
abs_series.sum()

91

In [ ]:
abs_series.cumsum()

0     6
1    29
2    83
3    85
4    91
dtype: int64

##Podpowiedzi

In [ ]:
# Suma kumulatywna to suma wartości poprzedzających dany rekord włącznie.
# Indeksy wartości minimalnych i maksymalnych znajdziesz z wykorzystaniem funkcji .idxmin() i .idxmax()

##Podpowiedzi + rozwiązanie

In [ ]:
# Suma kumulatywna to suma wartości poprzedzających dany rekord włącznie.
# Indeksy wartości minimalnych i maksymalnych znajdziesz z wykorzystaniem funkcji .idxmin() i .idxmax()

print("indeks najmniejszej wartości: ", abs_series.idxmin()) 
print("indeks największej wartości: ", abs_series.idxmax()) 
print(abs_series.sort_values(ascending = False))
print("suma: ", abs_series.sum())
print("suma kumulatywna: ", abs_series.cumsum())

indeks najmniejszej wartości:  3
indeks największej wartości:  2
2    54
1    23
4     6
0     6
3     2
dtype: int64
suma:  91
suma kumulatywna:  0     6
1    29
2    83
3    85
4    91
dtype: int64

#Zadanie 6

1. Wykorzystaj obiekt **lista_zakupow** z **zadania 1**.

2. Stwórz obiekt series nazwany **lista_cen** z wartościami : [2.99, 8, 1, 22.50, 3.30, 4.29, 9.50]

3. Stwórz obiekt series nazwany **lista_ilosci** z wartościami: [1, 1, 3, 1, 2, 8, 2]

4. Połącz te 3 obiekty series w obiekt DataFrame nazwany **zakupy**, nazywając kolumny tak, jak nazwane były poszczególne listy.

5. Wyświetl pierwsze 4 wartości tego DataFrame.

In [ ]:
import pandas as pd
import numpy as np

lista_cen = pd.Series([2.99, 8, 1, 22.50, 3.30, 4.29, 9.50])
lista_ilosci = pd.Series([1, 1, 3, 1, 2, 8, 2])

In [ ]:
lista_cen

0     2.99
1     8.00
2     1.00
3    22.50
4     3.30
5     4.29
6     9.50
dtype: float64

In [ ]:
lista_ilosci

0    1
1    1
2    3
3    1
4    2
5    8
6    2
dtype: int64

In [ ]:
list(lista_zakupow)

['mleko', 'jajka', 'pieprz', 'ser', 'woda', 'piwo', 'pomidory']

In [ ]:
dane = {'lista_zakupow':list(lista_zakupow), 'lista_cen':list(lista_cen),'lista_ilosci':list(lista_ilosci)}
dane

{'lista_cen': [2.99, 8.0, 1.0, 22.5, 3.3, 4.29, 9.5],
 'lista_ilosci': [1, 1, 3, 1, 2, 8, 2],
 'lista_zakupow': ['mleko',
  'jajka',
  'pieprz',
  'ser',
  'woda',
  'piwo',
  'pomidory']}

In [ ]:
zakupy = pd.DataFrame(data=dane)
zakupy

  lista_zakupow  lista_cen  lista_ilosci
0         mleko       2.99             1
1         jajka       8.00             1
2        pieprz       1.00             3
3           ser      22.50             1
4          woda       3.30             2
5          piwo       4.29             8
6      pomidory       9.50             2

In [ ]:
zakupy.head(4)

  lista_zakupow  lista_cen  lista_ilosci
0         mleko       2.99             1
1         jajka       8.00             1
2        pieprz       1.00             3
3           ser      22.50             1

##Podpowiedzi

In [ ]:
# DataFrame to dwuwymiarowy zbiór danych o elastycznym rozmiarze (możliwym do zmian). 
# Struktura danych zawiera opisane osie (wiersze i kolumny). To podstawowa struktura danych w pandas.
# Potraktuj obiekt DataFrame jako słownik, w którym kluczem jest nazwa kolumny a wartością obiekt pd.Series lub lista wartości.
# DataFrame może mieć dowolną ilość kolumn i wierszy.

##Podpowiedzi + rozwiązanie

In [ ]:
# DataFrame to dwuwymiarowy zbiór danych o elastycznym rozmiarze (możliwym do zmian). 
# Struktura danych zawiera opisane osie (wiersze i kolumny). To podstawowa struktura danych w pandas.
# Potraktuj obiekt DataFrame jako słownik, w którym kluczem jest nazwa kolumny a wartością obiekt pd.Series lub lista wartości.
# DataFrame może mieć dowolną ilość kolumn i wierszy.

lista_cen = pd.Series([2.99, 8, 1, 22.50, 3.30, 4.29, 9.50])
lista_ilosci = pd.Series([1, 1, 3, 1, 2, 8, 2])
zakupy = pd.DataFrame({"lista_zakupow":lista_zakupow, "lista_cen":lista_cen, "lista_ilosci":lista_ilosci})
zakupy.head(4)

  lista_zakupow  lista_cen  lista_ilosci
0         mleko       2.99             1
1         jajka       8.00             1
2        pieprz       1.00             3
3           ser      22.50             1

#Zadanie 7

1. Sprawdź następujące cechy DataFrame zakupy:
- Type
- Shape
- Wyświetl listę kolumn
- Opis DataFrame (funkcja describe() )

2. Jaki jest 25ty percentyl kolumny "**lista_cen**"? 

3. Jakie jest odchylenie standardowe (std) kolumny "**lista_ilosci**" ?

In [ ]:
print(type(zakupy))
print(zakupy.shape)
print(zakupy.columns)
print(zakupy.describe())

<class 'pandas.core.frame.DataFrame'>
(7, 3)
Index(['lista_zakupow', 'lista_cen', 'lista_ilosci'], dtype='object')
       lista_cen  lista_ilosci
count   7.000000      7.000000
mean    7.368571      2.571429
std     7.299124      2.507133
min     1.000000      1.000000
25%     3.145000      1.000000
50%     4.290000      2.000000
75%     8.750000      2.500000
max    22.500000      8.000000

##Podpowiedzi

In [ ]:
# Często będziesz korzystać z komendy .describe() w celu eksploracyjnej analizy danych.
# Więcej o znaczeniu odchylenia standardowego i percentyli w dalszych modułach.
# Listę kolumn można wyświetlić wykorzystując funkcję .columns
# Zwróć uwagę, że tylko dwie kolumny zostają opisane przy użyciu funkcji describe - nie obejmuje ona kolumn z wartościami kategorycznymi.

##Podpowiedzi + rozwiązanie

In [ ]:
# Często będziesz korzystać z komendy .describe() w celu eksploracyjnej analizy danych.
# Więcej o znaczeniu odchylenia standardowego i percentyli w dalszych modułach.
# Listę kolumn można wyświetlić wykorzystując funkcję .columns
# Zwróć uwagę, że tylko dwie kolumny zostają opisane przy użyciu funkcji describe - nie obejmuje ona kolumn z wartościami kategorycznymi.

print(type(zakupy))
print(zakupy.shape)
print(zakupy.columns)
print(zakupy.describe())

# Odchylenie standardowe kolumny lista_ilosci wynosi 2.507133
# 25ty percentyl listy cen to 3.145

<class 'pandas.core.frame.DataFrame'>
(7, 3)
Index(['lista_zakupow', 'lista_cen', 'lista_ilosci'], dtype='object')
       lista_cen  lista_ilosci
count   7.000000      7.000000
mean    7.368571      2.571429
std     7.299124      2.507133
min     1.000000      1.000000
25%     3.145000      1.000000
50%     4.290000      2.000000
75%     8.750000      2.500000
max    22.500000      8.000000

#Zadanie 8

1. Ustaw kolumnę "**lista_zakupow**" jako indeks DataFrame **zakupy**. Wyświetl zaktualizowany DataFrame. 

2. Stwórz kolumnę "**koszt**", która będzie zawierała iloczyn listy cen i listy ilości.

3. Zresetuj indeks DataFrame **zakupy**. Wyświetl zaktualizowany DataFrame **zakupy**.

In [ ]:
zakupy2 = zakupy.set_index(zakupy['lista_zakupow'])

In [ ]:
zakupy2

              lista_zakupow  lista_cen  lista_ilosci
lista_zakupow
mleko                 mleko       2.99             1
jajka                 jajka       8.00             1
pieprz               pieprz       1.00             3
ser                     ser      22.50             1
woda                   woda       3.30             2
piwo                   piwo       4.29             8
pomidory           pomidory       9.50             2

In [ ]:
koszt = zakupy2['lista_cen']*zakupy2['lista_ilosci']
list(koszt)

[2.99, 8.0, 3.0, 22.5, 6.6, 34.32, 19.0]

In [ ]:
zakupy2['koszt'] = zakupy2['lista_cen']*zakupy2['lista_ilosci']

In [ ]:
zakupy2

              lista_zakupow  lista_cen  lista_ilosci  koszt
lista_zakupow
mleko                 mleko       2.99             1   2.99
jajka                 jajka       8.00             1   8.00
pieprz               pieprz       1.00             3   3.00
ser                     ser      22.50             1  22.50
woda                   woda       3.30             2   6.60
piwo                   piwo       4.29             8  34.32
pomidory           pomidory       9.50             2  19.00

##Podpowiedzi

In [ ]:
# Do ustawienia i zresetowania indeksu użyj funkcji .set_index() oraz .reset_index()
# Przy wielokrotnych uruchomieniach danej komórki warto takie linijki wyłączyć z programu przez użycie # - oznaczyć je jako komentarz. Inaczej program może się zgubić.
# Dodawanie nowych kolumn na podstawie wartości pozostałych kolumn będzie czymś, co będziesz często robić.

##Podpowiedzi + rozwiązanie

In [ ]:
# Do ustawienia i zresetowania indeksu użyj funkcji .set_index() oraz .reset_index()
# Przy wielokrotnych uruchomieniach danej komórki warto takie linijki wyłączyć z programu przez użycie # - oznaczyć je jako komentarz. Inaczej program może się zgubić.
# Dodawanie nowych kolumn na podstawie wartości pozostałych kolumn będzie czymś, co będziesz często robić.

#zakupy = zakupy.set_index('lista_zakupow')
print(zakupy)

zakupy['koszt'] = zakupy['lista_cen']*zakupy['lista_ilosci']
zakupy = zakupy.reset_index()
print(zakupy)

#Zadanie 9

1. Stwórz dwa arrays o wielkości 4, z numerami 2,3,4,5 w **array1** oraz 6,8,10,12 w **array2** odpowiednio.

2. Znajdź sumę, iloczyn, różnicę oraz iloraz.

3. Wyświetl wyniki.

In [ ]:
ar1 = pd.array([2,3,4,5])
ar2 = pd.array([6,8,10,12])

In [ ]:
ar1*ar2

<IntegerArray>
[12, 24, 40, 60]
Length: 4, dtype: Int64

In [ ]:
ar1+ar2

<IntegerArray>
[8, 11, 14, 17]
Length: 4, dtype: Int64

In [ ]:
ar1/ar2

array([0.33333333, 0.375     , 0.4       , 0.41666667])

In [ ]:
ar1-ar2

<IntegerArray>
[-4, -5, -6, -7]
Length: 4, dtype: Int64

##Podpowiedzi

In [ ]:
# Array "ręcznie" można definiować za pomocą zapisu array1 = np.array([2,3,4,5])
# Działania matematyczne na arrays można przeprowadzać jak na normalnych zmiennych.
# Zaobserwuj co się stanie jak arrays będą miały różne wielkości (długości).

##Podpowiedzi + rozwiązanie

In [ ]:
# Array "ręcznie" można definiować za pomocą zapisu array1 = np.array([2,3,4,5])
# Działania matematyczne na arrays można przeprowadzać jak na normalnych zmiennych.
# Zaobserwuj co się stanie jak arrays będą miały różne wielkości (długości).

array1 = np.array([2, 3, 4, 5])
array2 = np.array([6, 8, 10, 12])

array_sum = array1 + array2
print("Suma: ", array_sum)

product = array1 * array2
print("Iloczyn: ",product)

difference = array1 - array2
print("Różnica: ", difference)

quotient = array1 / array2
print("Iloraz: ", quotient)

Suma:  [ 8 11 14 17]
Iloczyn:  [12 24 40 60]
Różnica:  [-4 -5 -6 -7]
Iloraz:  [0.33333333 0.375      0.4        0.41666667]

#Zadanie 10

1. Stwórz obiekt Date Series rozpoczynający się 8 lutego 2019 a kończący 20 lutego 2019 z rozdzielczością godzinową.

2. Przekształć go w pandas DataFrame. Nazwij go **df**. Niech bazowa kolumna nazywa się '**baza**' i zawiera wartości z powyższego date series.

3. Sprawdź **dtypes** tego DataFrame.

4. Stwórz kolumnę zawierającą wyłącznie godzinę (ekstrakcja z formatu datetime64)

5. Stwórz kolumnę zawierającą wyłącznie dzień tygodnia (jego numer, gdzie poniedziałek to 0 a niedziela 6)

6. Stwórz kolumnę zawierającą informację, czy jest weekend. Niech ta kolumna zawiera wartości 1 - jeśli jest weekend, 0 - jeśli nie ma.

7. Stwórz kolumnę zawierającą informację czy jest późno (tj. godzina między 18 a 6 włącznie). Jeśli jest późno, niech w kolumnie będzie wartość - 1, jeśli nie - 0.

8. Wyświetl wyłącznie część DataFrame, która jest w weekend i z późnymi godzinami.

In [ ]:
import pandas as pd
import numpy as np
dates = pd.date_range('20190208','20190220',freq = "H")

In [ ]:
dates

DatetimeIndex(['2019-02-08 00:00:00', '2019-02-08 01:00:00',
               '2019-02-08 02:00:00', '2019-02-08 03:00:00',
               '2019-02-08 04:00:00', '2019-02-08 05:00:00',
               '2019-02-08 06:00:00', '2019-02-08 07:00:00',
               '2019-02-08 08:00:00', '2019-02-08 09:00:00',
               ...
               '2019-02-19 15:00:00', '2019-02-19 16:00:00',
               '2019-02-19 17:00:00', '2019-02-19 18:00:00',
               '2019-02-19 19:00:00', '2019-02-19 20:00:00',
               '2019-02-19 21:00:00', '2019-02-19 22:00:00',
               '2019-02-19 23:00:00', '2019-02-20 00:00:00'],
              dtype='datetime64[ns]', length=289, freq='H')

In [ ]:
df = pd.DataFrame({'baza': list(dates)})
df

                   baza
0   2019-02-08 00:00:00
1   2019-02-08 01:00:00
2   2019-02-08 02:00:00
3   2019-02-08 03:00:00
4   2019-02-08 04:00:00
..                  ...
284 2019-02-19 20:00:00
285 2019-02-19 21:00:00
286 2019-02-19 22:00:00
287 2019-02-19 23:00:00
288 2019-02-20 00:00:00

[289 rows x 1 columns]

In [ ]:
df['godziny'] = list(df['baza'].dt.hour)
df

                   baza  godziny
0   2019-02-08 00:00:00        0
1   2019-02-08 01:00:00        1
2   2019-02-08 02:00:00        2
3   2019-02-08 03:00:00        3
4   2019-02-08 04:00:00        4
..                  ...      ...
284 2019-02-19 20:00:00       20
285 2019-02-19 21:00:00       21
286 2019-02-19 22:00:00       22
287 2019-02-19 23:00:00       23
288 2019-02-20 00:00:00        0

[289 rows x 2 columns]

In [ ]:
df['dzientyg'] = list(df['baza'].dt.dayofweek)
df

                   baza  godziny  dzientyg
0   2019-02-08 00:00:00        0         4
1   2019-02-08 01:00:00        1         4
2   2019-02-08 02:00:00        2         4
3   2019-02-08 03:00:00        3         4
4   2019-02-08 04:00:00        4         4
..                  ...      ...       ...
284 2019-02-19 20:00:00       20         1
285 2019-02-19 21:00:00       21         1
286 2019-02-19 22:00:00       22         1
287 2019-02-19 23:00:00       23         1
288 2019-02-20 00:00:00        0         2

[289 rows x 3 columns]

In [ ]:
df['weekend'] = df['dzientyg']>4
df

                   baza  godziny  dzientyg  weekend
0   2019-02-08 00:00:00        0         4    False
1   2019-02-08 01:00:00        1         4    False
2   2019-02-08 02:00:00        2         4    False
3   2019-02-08 03:00:00        3         4    False
4   2019-02-08 04:00:00        4         4    False
..                  ...      ...       ...      ...
284 2019-02-19 20:00:00       20         1    False
285 2019-02-19 21:00:00       21         1    False
286 2019-02-19 22:00:00       22         1    False
287 2019-02-19 23:00:00       23         1    False
288 2019-02-20 00:00:00        0         2    False

[289 rows x 4 columns]

In [ ]:
df['pozno'] = ((df['godziny']>=18) | (df['godziny']<=6)) 
df

                   baza  godziny  dzientyg  weekend  pozno
0   2019-02-08 00:00:00        0         4    False   True
1   2019-02-08 01:00:00        1         4    False   True
2   2019-02-08 02:00:00        2         4    False   True
3   2019-02-08 03:00:00        3         4    False   True
4   2019-02-08 04:00:00        4         4    False   True
..                  ...      ...       ...      ...    ...
284 2019-02-19 20:00:00       20         1    False   True
285 2019-02-19 21:00:00       21         1    False   True
286 2019-02-19 22:00:00       22         1    False   True
287 2019-02-19 23:00:00       23         1    False   True
288 2019-02-20 00:00:00        0         2    False   True

[289 rows x 5 columns]

In [ ]:
df[(df['weekend'] == True) & (df['pozno'] == True)]

                   baza  godziny  dzientyg  weekend  pozno
24  2019-02-09 00:00:00        0         5     True   True
25  2019-02-09 01:00:00        1         5     True   True
26  2019-02-09 02:00:00        2         5     True   True
27  2019-02-09 03:00:00        3         5     True   True
28  2019-02-09 04:00:00        4         5     True   True
29  2019-02-09 05:00:00        5         5     True   True
30  2019-02-09 06:00:00        6         5     True   True
42  2019-02-09 18:00:00       18         5     True   True
43  2019-02-09 19:00:00       19         5     True   True
44  2019-02-09 20:00:00       20         5     True   True
45  2019-02-09 21:00:00       21         5     True   True
46  2019-02-09 22:00:00       22         5     True   True
47  2019-02-09 23:00:00       23         5     True   True
48  2019-02-10 00:00:00        0         6     True   True
49  2019-02-10 01:00:00        1         6     True   True
50  2019-02-10 02:00:00        2         6     True   True
51  2019-02-10 03:00:00        3         6     True   True
52  2019-02-10 04:00:00        4         6     True   True
53  2019-02-10 05:00:00        5         6     True   True
54  2019-02-10 06:00:00        6         6     True   True
66  2019-02-10 18:00:00       18         6     True   True
67  2019-02-10 19:00:00       19         6     True   True
68  2019-02-10 20:00:00       20         6     True   True
69  2019-02-10 21:00:00       21         6     True   True
70  2019-02-10 22:00:00       22         6     True   True
71  2019-02-10 23:00:00       23         6     True   True
192 2019-02-16 00:00:00        0         5     True   True
193 2019-02-16 01:00:00        1         5     True   True
194 2019-02-16 02:00:00        2         5     True   True
195 2019-02-16 03:00:00        3         5     True   True
196 2019-02-16 04:00:00        4         5     True   True
197 2019-02-16 05:00:00        5         5     True   True
198 2019-02-16 06:00:00        6         5     True   True
210 2019-02-16 18:00:00       18         5     True   True
211 2019-02-16 19:00:00       19         5     True   True
212 2019-02-16 20:00:00       20         5     True   True
213 2019-02-16 21:00:00       21         5     True   True
214 2019-02-16 22:00:00       22         5     True   True
215 2019-02-16 23:00:00       23         5     True   True
216 2019-02-17 00:00:00        0         6     True   True
217 2019-02-17 01:00:00        1         6     True   True
218 2019-02-17 02:00:00        2         6     True   True
219 2019-02-17 03:00:00        3         6     True   True
220 2019-02-17 04:00:00        4         6     True   True
221 2019-02-17 05:00:00        5         6     True   True
222 2019-02-17 06:00:00        6         6     True   True
234 2019-02-17 18:00:00       18         6     True   True
235 2019-02-17 19:00:00       19         6     True   True
236 2019-02-17 20:00:00       20         6     True   True
237 2019-02-17 21:00:00       21         6     True   True
238 2019-02-17 22:00:00       22         6     True   True
239 2019-02-17 23:00:00       23         6     True   True

##Podpowiedzi

In [ ]:
# Do zdefiniowania DataFrame wykorzystaj zapis jak przy definicji słownika, tj. {'klucz': wartosc}
# Do odnoszenia się do kolumny z danymi typu datetime64 wykorzystaj zapis .dt.minute - jeśli przykładowo chcesz odczytać minutę.
# Format pandas datetime jest jednym z najbardziej przystępnych formatów zapisu daty oraz godziny. Serio.
# Przy definiowaniu nowych kolumn, które odnoszą się do warunków logicznych upewnij się, 
# że każda część warunku logicznego jest w nawiasie lub można się do niej bezpośrednio odnieść (np. jest liczbą),
# Przykładowy zapis df['ptak'] = ((df['kura'] == 1) | (df['kaczka'] == 1) | (df['ges'] == 1)) zwróci zapis True, jeśli któraś z kolumn kura, kaczka lub ges ma zapis 1. 
# Wartości bool można łatwo przekształcić w integery za pomocą ().astype(int)

##Podpowiedzi + rozwiązanie

In [ ]:
# Do zdefiniowania DataFrame wykorzystaj zapis jak przy definicji słownika, tj. {'klucz': wartosc}
# Do odnoszenia się do kolumny z danymi typu datetime64 wykorzystaj zapis .dt.minute - jeśli przykładowo chcesz odczytać minutę.
# Format pandas datetime jest jednym z najbardziej przystępnych formatów zapisu daty oraz godziny. Serio.
# Przy definiowaniu nowych kolumn, które odnoszą się do warunków logicznych upewnij się, 
# że każda część warunku logicznego jest w nawiasie lub można się do niej bezpośrednio odnieść (np. jest liczbą),
# Przykładowy zapis df['ptak'] = ((df['kura'] == 1) | (df['kaczka'] == 1) | (df['ges'] == 1)) zwróci zapis True, jeśli któraś z kolumn kura, kaczka lub ges ma zapis 1. 
# Wartości bool można łatwo przekształcić w integery za pomocą ().astype(int)

# Aby otrzymać krok godzinowy, ustaw parametr freq='H' w funkcji pd.date_range()
godziny = pd.date_range(start='20190208', end='20190220', freq='H')
df = pd.DataFrame({"baza": godziny})
df['godzina'] = df['baza'].dt.hour
df['dzien_tygodnia'] = df['baza'].dt.dayofweek
df['weekend'] = (df['dzien_tygodnia']>=5).astype(int)
df['pozno'] = ((df['godzina'] >= 18) | (df['godzina'] <= 6)).astype(int)

print(df[(df['pozno']==1) & (df['weekend']==1)])

                   baza  godzina  dzien_tygodnia  weekend  pozno
24  2019-02-09 00:00:00        0               5        1      1
25  2019-02-09 01:00:00        1               5        1      1
26  2019-02-09 02:00:00        2               5        1      1
27  2019-02-09 03:00:00        3               5        1      1
28  2019-02-09 04:00:00        4               5        1      1
29  2019-02-09 05:00:00        5               5        1      1
30  2019-02-09 06:00:00        6               5        1      1
42  2019-02-09 18:00:00       18               5        1      1
43  2019-02-09 19:00:00       19               5        1      1
44  2019-02-09 20:00:00       20               5        1      1
45  2019-02-09 21:00:00       21               5        1      1
46  2019-02-09 22:00:00       22               5        1      1
47  2019-02-09 23:00:00       23               5        1      1
48  2019-02-10 00:00:00        0               6        1      1
49  2019-02-10 01:00:00        1               6        1      1
50  2019-02-10 02:00:00        2               6        1      1
51  2019-02-10 03:00:00        3               6        1      1
52  2019-02-10 04:00:00        4               6        1      1
53  2019-02-10 05:00:00        5               6        1      1
54  2019-02-10 06:00:00        6               6        1      1
66  2019-02-10 18:00:00       18               6        1      1
67  2019-02-10 19:00:00       19               6        1      1
68  2019-02-10 20:00:00       20               6        1      1
69  2019-02-10 21:00:00       21               6        1      1
70  2019-02-10 22:00:00       22               6        1      1
71  2019-02-10 23:00:00       23               6        1      1
192 2019-02-16 00:00:00        0               5        1      1
193 2019-02-16 01:00:00        1               5        1      1
194 2019-02-16 02:00:00        2               5        1      1
195 2019-02-16 03:00:00        3               5        1      1
196 2019-02-16 04:00:00        4               5        1      1
197 2019-02-16 05:00:00        5               5        1      1
198 2019-02-16 06:00:00        6               5        1      1
210 2019-02-16 18:00:00       18               5        1      1
211 2019-02-16 19:00:00       19               5        1      1
212 2019-02-16 20:00:00       20               5        1      1
213 2019-02-16 21:00:00       21               5        1      1
214 2019-02-16 22:00:00       22               5        1      1
215 2019-02-16 23:00:00       23               5        1      1
216 2019-02-17 00:00:00        0               6        1      1
217 2019-02-17 01:00:00        1               6        1      1
218 2019-02-17 02:00:00        2               6        1      1
219 2019-02-17 03:00:00        3               6        1      1
220 2019-02-17 04:00:00        4               6        1      1
221 2019-02-17 05:00:00        5               6        1      1
222 2019-02-17 06:00:00        6               6        1      1
234 2019-02-17 18:00:00       18               6        1      1
235 2019-02-17 19:00:00       19               6        1      1
236 2019-02-17 20:00:00       20               6        1      1
237 2019-02-17 21:00:00       21               6        1      1
238 2019-02-17 22:00:00       22               6        1      1
239 2019-02-17 23:00:00       23               6        1      1

#Zadanie 11

1. Zaimportuj pakiet seaborn jako sns.

2. Załaduj dataset "**tips**" za pomocą sns.load_dataset("tips") jako pandas DataFrame o nazwie **df**.

3. Sprawdź czy są jakieś brakujące wartości

4. Dodaj kolumnę o nazwie '**procent**', w której będzie zawarta informacja jaki procent całkowitej kwoty stanowi napiwek.

5. Sprawdź, czy napiwek >20% kwoty dało więcej osób palących czy niepalących.

In [ ]:
import seaborn as sns

In [ ]:
df2 = pd.DataFrame(sns.load_dataset("tips"))
df2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
df2.isnull()

     total_bill    tip    sex  smoker    day   time   size
0         False  False  False   False  False  False  False
1         False  False  False   False  False  False  False
2         False  False  False   False  False  False  False
3         False  False  False   False  False  False  False
4         False  False  False   False  False  False  False
..          ...    ...    ...     ...    ...    ...    ...
239       False  False  False   False  False  False  False
240       False  False  False   False  False  False  False
241       False  False  False   False  False  False  False
242       False  False  False   False  False  False  False
243       False  False  False   False  False  False  False

[244 rows x 7 columns]

In [ ]:
df2.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [ ]:
df2['procent'] = df2['tip'] / df2['total_bill']

In [ ]:
df2['20procent'] = df2['procent']>0.2
porownanie = df2.groupby(["smoker", "20procent"]).count()
porownanie

                  total_bill  tip  sex  day  time  size  procent
smoker 20procent
Yes    False              77   77   77   77    77    77       77
       True               16   16   16   16    16    16       16
No     False             128  128  128  128   128   128      128
       True               23   23   23   23    23    23       23

##Podpowiedzi

In [ ]:
# seaborn to pakiet do wizualizacji danych ale ma kilka przydatnych datasetów do treningów.
# Sprawdzenie obecności wartości brakujących to jeden z pierwszych kroków przy eksploracyjnej analizie danych. Robi się go praktycznie zawsze.
# Aby poznać wielkość grup po grupowaniu, poprzez groupby wykorzystaj funkcję .size()

##Podpowiedzi + rozwiązanie

In [ ]:
# seaborn to pakiet do wizualizacji danych ale ma kilka przydatnych datasetów do treningów.
# Sprawdzenie obecności wartości brakujących to jeden z pierwszych kroków przy eksploracyjnej analizie danych. Robi się go praktycznie zawsze.
# Aby poznać wielkość grup po grupowaniu, poprzez groupby wykorzystaj funkcję .size()

import seaborn as sns
df = pd.DataFrame(sns.load_dataset("tips"))
df.isnull().sum()
df['procent'] = df['tip']/df['total_bill'] *100
df[(df['procent'] > 20)].groupby(['smoker']).size()

#Zadanie 12

1. Policz długość cienia, którą rzucasz, dla swojego wzrostu i położenia geograficznego.

2. Dane o wysokości słońca zbierz stąd:
http://astronomia.zagan.pl/pliki/pozycja_slonca.html

3. Stwórz dwa obiekty series o dowolnej (ale równej) długości i połącz je w DataFrame.

* Pierwszy series powinien zawierać datę (przykładowo - 10 dnia miesiąca o tej samej godzinie) - czyli 12 pól, od stycznia do grudnia. 
* Drugi powinien zawierać wysokość słońca (dane w stopniach).

4. Dodaj kolumnę '**dlugosc_cienia**' z kalkulacją, jakiej długości rzucisz cień.

##Podpowiedzi

In [ ]:
# Z trygonometrii: b = a/tan(alfa), gdzie b - długość cienia oraz a - wysokość osoby rzucającej cień.
# Pamiętaj, aby przekształcić dane w stopniach na radiany.
# Wykorzystaj do tego bibliotekę numpy i funkcję np.radians.

##Podpowiedzi + rozwiązanie

In [ ]:
# Dane dla miasta Gdańsk
# Mój wzrost (wysokość) - 1.83m
# Dane zbierane dla 10 dnia miesiąca w południe
# Z trygonometrii: b = a/tan(alfa), gdzie b - długość cienia oraz a - wysokość osoby rzucającej cień.
# Pamiętaj, aby przekształcić dane w stopniach na radiany.
# Wykorzystaj do tego bibliotekę numpy i funkcję np.radians.

import pandas as pd
import numpy as np

miesiac = pd.Series(["Styczeń", "Luty", "Marzec", "Kwiecień", "Maj", "Czerwiec", "Lipiec", "Sierpień", "Wrzesień", "Pazdziernik", "Listopad", "Grudzien"])
wysokosc = pd.Series([13.7, 21.24, 31.83, 43.79, 53.29, 58.59, 57.75, 50.97, 40.2, 28.49, 18.06, 12.21])
a = 1.83 #podaję mój wzrost
df = pd.DataFrame({"miesiac": miesiac, "wysokosc": wysokosc})
df['dlugosc_cienia'] = (a/np.tan(np.radians(df['wysokosc'])))
df